MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAB288/mcu.h
extern volatile __PB2DIVbits_t PB2DIVbits __asm__ ("PB2DIV") __attribute__((section("sfrs"), address(0xBF801350)));
extern volatile uint32_t        PB2DIVCLR __attribute__((section("sfrs"),address(0xBF801354)));
extern volatile uint32_t        PB2DIVSET __attribute__((section("sfrs"),address(0xBF801358)));
extern volatile uint32_t        PB2DIVINV __attribute__((section("sfrs"),address(0xBF80135C)));
#define PB3DIV PB3DIV
extern volatile uint32_t   PB3DIV __attribute__((section("sfrs"), address(0xBF801360)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t ON:1;
} __PB3DIVbits_t;
extern volatile __PB3DIVbits_t PB3DIVbits __asm__ ("PB3DIV") __attribute__((section("sfrs"), address(0xBF801360)));
extern volatile uint32_t        PB3DIVCLR __attribute__((section("sfrs"),address(0xBF801364)));
extern volatile uint32_t        PB3DIVSET __attribute__((section("sfrs"),address(0xBF801368)));
extern volatile uint32_t        PB3DIVINV __attribute__((section("sfrs"),address(0xBF80136C)));
#define PB4DIV PB4DIV
extern volatile uint32_t   PB4DIV __attribute__((section("sfrs"), address(0xBF801370)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t ON:1;
} __PB4DIVbits_t;
extern volatile __PB4DIVbits_t PB4DIVbits __asm__ ("PB4DIV") __attribute__((section("sfrs"), address(0xBF801370)));
extern volatile uint32_t        PB4DIVCLR __attribute__((section("sfrs"),address(0xBF801374)));
extern volatile uint32_t        PB4DIVSET __attribute__((section("sfrs"),address(0xBF801378)));
extern volatile uint32_t        PB4DIVINV __attribute__((section("sfrs"),address(0xBF80137C)));
#define PB5DIV PB5DIV
extern volatile uint32_t   PB5DIV __attribute__((section("sfrs"), address(0xBF801380)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t ON:1;
} __PB5DIVbits_t;
extern volatile __PB5DIVbits_t PB5DIVbits __asm__ ("PB5DIV") __attribute__((section("sfrs"), address(0xBF801380)));
extern volatile uint32_t        PB5DIVCLR __attribute__((section("sfrs"),address(0xBF801384)));
extern volatile uint32_t        PB5DIVSET __attribute__((section("sfrs"),address(0xBF801388)));
extern volatile uint32_t        PB5DIVINV __attribute__((section("sfrs"),address(0xBF80138C)));
#define PB6DIV PB6DIV
extern volatile uint32_t   PB6DIV __attribute__((section("sfrs"), address(0xBF801390)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t ON:1;
} __PB6DIVbits_t;
extern volatile __PB6DIVbits_t PB6DIVbits __asm__ ("PB6DIV") __attribute__((section("sfrs"), address(0xBF801390)));
extern volatile uint32_t        PB6DIVCLR __attribute__((section("sfrs"),address(0xBF801394)));
extern volatile uint32_t        PB6DIVSET __attribute__((section("sfrs"),address(0xBF801398)));
extern volatile uint32_t        PB6DIVINV __attribute__((section("sfrs"),address(0xBF80139C)));
#define PB7DIV PB7DIV
extern volatile uint32_t   PB7DIV __attribute__((section("sfrs"), address(0xBF8013A0)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t ON:1;
} __PB7DIVbits_t;
extern volatile __PB7DIVbits_t PB7DIVbits __asm__ ("PB7DIV") __attribute__((section("sfrs"), address(0xBF8013A0)));
extern volatile uint32_t        PB7DIVCLR __attribute__((section("sfrs"),address(0xBF8013A4)));
extern volatile uint32_t        PB7DIVSET __attribute__((section("sfrs"),address(0xBF8013A8)));
extern volatile uint32_t        PB7DIVINV __attribute__((section("sfrs"),address(0xBF8013AC)));
#define SLEWCON SLEWCON
extern volatile uint32_t   SLEWCON __attribute__((section("sfrs"), address(0xBF8013C0)));
typedef struct {
  uint32_t BUSY:1;
  uint32_t DNEN:1;
  uint32_t UPEN:1;
  uint32_t :5;
  uint32_t SLWDIV:3;
  uint32_t :5;
  uint32_t SYSDIV:4;
} __SLEWCONbits_t;
extern volatile __SLEWCONbits_t SLEWCONbits __asm__ ("SLEWCON") __attribute__((section("sfrs"), address(0xBF8013C0)));
extern volatile uint32_t        SLEWCONCLR __attribute__((section("sfrs"),address(0xBF8013C4)));
extern volatile uint32_t        SLEWCONSET __attribute__((section("sfrs"),address(0xBF8013C8)));
extern volatile uint32_t        SLEWCONINV __attribute__((section("sfrs"),address(0xBF8013CC)));
#define CLKSTAT CLKSTAT
extern volatile uint32_t   CLKSTAT __attribute__((section("sfrs"), address(0xBF8013D0)));
typedef union {
  struct {
    uint32_t FRCRDY:1;
    uint32_t SPDIVRDY:1;
    uint32_t POSCRDY:1;
    uint32_t :1;
    uint32_t SOSCRDY:1;
    uint32_t LPRCRDY:1;
    uint32_t :1;
    uint32_t SPLLRDY:1;
  };
  struct {
    uint32_t :1;
    uint32_t DIVSPLLRDY:1;
  };
} __CLKSTATbits_t;
extern volatile __CLKSTATbits_t CLKSTATbits __asm__ ("CLKSTAT") __attribute__((section("sfrs"), address(0xBF8013D0)));
extern volatile uint32_t        CLKSTATCLR __attribute__((section("sfrs"),address(0xBF8013D4)));
extern volatile uint32_t        CLKSTATSET __attribute__((section("sfrs"),address(0xBF8013D8)));
extern volatile uint32_t        CLKSTATINV __attribute__((section("sfrs"),address(0xBF8013DC)));
#define INT1R INT1R
extern volatile uint32_t   INT1R __attribute__((section("sfrs"), address(0xBF801404)));
typedef struct {
  uint32_t INT1R:4;
} __INT1Rbits_t;
extern volatile __INT1Rbits_t INT1Rbits __asm__ ("INT1R") __attribute__((section("sfrs"), address(0xBF801404)));
#define INT2R INT2R
extern volatile uint32_t   INT2R __attribute__((section("sfrs"), address(0xBF801408)));
typedef struct {
  uint32_t INT2R:4;
} __INT2Rbits_t;
extern volatile __INT2Rbits_t INT2Rbits __asm__ ("INT2R") __attribute__((section("sfrs"), address(0xBF801408)));
#define INT3R INT3R
extern volatile uint32_t   INT3R __attribute__((section("sfrs"), address(0xBF80140C)));
typedef struct {
  uint32_t INT3R:4;
} __INT3Rbits_t;
extern volatile __INT3Rbits_t INT3Rbits __asm__ ("INT3R") __attribute__((section("sfrs"), address(0xBF80140C)));
#define INT4R INT4R
extern volatile uint32_t   INT4R __attribute__((section("sfrs"), address(0xBF801410)));
typedef struct {
  uint32_t INT4R:4;
} __INT4Rbits_t;
extern volatile __INT4Rbits_t INT4Rbits __asm__ ("INT4R") __attribute__((section("sfrs"), address(0xBF801410)));
#define T2CKR T2CKR
extern volatile uint32_t   T2CKR __attribute__((section("sfrs"), address(0xBF801418)));
typedef struct {
  uint32_t T2CKR:4;
} __T2CKRbits_t;
extern volatile __T2CKRbits_t T2CKRbits __asm__ ("T2CKR") __attribute__((section("sfrs"), address(0xBF801418)));
#define T3CKR T3CKR
extern volatile uint32_t   T3CKR __attribute__((section("sfrs"), address(0xBF80141C)));
typedef struct {
  uint32_t T3CKR:4;
} __T3CKRbits_t;
extern volatile __T3CKRbits_t T3CKRbits __asm__ ("T3CKR") __attribute__((section("sfrs"), address(0xBF80141C)));
#define T4CKR T4CKR
extern volatile uint32_t   T4CKR __attribute__((section("sfrs"), address(0xBF801420)));
typedef struct {
  uint32_t T4CKR:4;
} __T4CKRbits_t;
extern volatile __T4CKRbits_t T4CKRbits __asm__ ("T4CKR") __attribute__((section("sfrs"), address(0xBF801420)));
#define T5CKR T5CKR
extern volatile uint32_t   T5CKR __attribute__((section("sfrs"), address(0xBF801424)));
typedef struct {
  uint32_t T5CKR:4;
} __T5CKRbits_t;
